Revit 2027 API
ParameterFilterRuleFactory.CreateSharedParameterApplicableRule Method
 Creates a filter rule that tests elements for support of a shared parameter.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FilterRule CreateSharedParameterApplicableRule(
	string parameterName
)
Public Shared Function CreateSharedParameterApplicableRule (
	parameterName As String
) As FilterRule
public:
static FilterRule^ CreateSharedParameterApplicableRule(
	String^ parameterName
)
static member CreateSharedParameterApplicableRule :
        parameterName : string -> FilterRule
Parameters
parameterName String
 The name of the parameter that elements must support to satisfy this rule.
Return Value
FilterRule
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
See Also
Reference
ParameterFilterRuleFactory Class
Autodesk.Revit.DB Namespace